DataProcessors/гф_ФормированиеСпецификацийПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<DataProcessor>
		<Properties>
			<Name>гф_ФормированиеСпецификацийПокупателя</Name>
			<Comment>#wortmann #Спецификация покупателя Галфинд Окунев 2022/07/20</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоллекцииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Спецификации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Флаг</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпецификацияПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.гф_СпецификацияПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проведен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/гф_СтатусРаботыСЗаказомИ5.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>гф_СтатусРаботыСЗаказомИ5</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменен</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпущенаСпецификация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гф_СтатусРаботыСЗаказомИ5</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.гф_СтатусРаботыСЗаказомИ5</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/гф_СпецификацияПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>гф_СпецификацияПокупателя</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаказыКлиентов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/гф_ФормированиеСпецификацийПокупателя/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОтметитьВсе(Команда)
	
	Для Каждого Строка Из Объект.Спецификации Цикл
		
		Строка.Флаг = Истина;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВсеОтметки(Команда)
	
	Для Каждого Строка Из Объект.Спецификации Цикл
		
		Строка.Флаг = Ложь;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказКлиента.Контрагент КАК Контрагент,
	|	ЗаказКлиента.Договор КАК Договор,
	|	ЗаказКлиента.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ПО ЗаказКлиента.Договор = ДоговорыКонтрагентов.Ссылка
	|		ПО ЗаказКлиентаТовары.Ссылка = ЗаказКлиента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураЗаказа
	|		ПО ЗаказКлиентаТовары.Номенклатура = НоменклатураЗаказа.Ссылка
	|ГДЕ
	|	ЗаказКлиента.Организация = &Организация
	|	И ЗаказКлиента.гф_СтатусРаботыСЗаказомИ5 = ЗНАЧЕНИЕ(Перечисление.гф_СтатусРаботыСЗаказомИ5.Подтвержден)
	|	И ЗаказКлиента.Склад = &Склад
	|	И (ДоговорыКонтрагентов.гф_Сезон = &Сезон
	|			ИЛИ &Сезон = ЗНАЧЕНИЕ(Справочник.КоллекцииНоменклатуры.ПустаяСсылка))
	|	И ЗаказКлиента.Проведен
	|	И НоменклатураЗаказа.ВидНоменклатуры = &ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Контрагент КАК Контрагент,
	|	ВТ_Заказы.Договор КАК Договор,
	|	МАКСИМУМ(гф_СпецификацияПокупателяЗаказыКлиентов.Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Спецификации
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гф_СпецификацияПокупателя.ЗаказыКлиентов КАК гф_СпецификацияПокупателяЗаказыКлиентов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.гф_СпецификацияПокупателя КАК гф_СпецификацияПокупателя
	|			ПО гф_СпецификацияПокупателяЗаказыКлиентов.Ссылка = гф_СпецификацияПокупателя.Ссылка
	|		ПО ВТ_Заказы.Заказ = гф_СпецификацияПокупателяЗаказыКлиентов.ЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заказы.Контрагент,
	|	ВТ_Заказы.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Контрагент КАК Контрагент,
	|	ВТ_Заказы.Договор КАК ДоговорКонтрагента,
	|	ВТ_Заказы.Заказ КАК ЗаказКлиента
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК Флаг,
	|	ВТ_Спецификации.Контрагент КАК Контрагент,
	|	ВТ_Спецификации.Договор КАК ДоговорКонтрагента,
	|	ВТ_Спецификации.Ссылка КАК СпецификацияПокупателя,
	|	гф_СпецификацияПокупателя.Проведен КАК Проведен
	|ИЗ
	|	ВТ_Спецификации КАК ВТ_Спецификации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гф_СпецификацияПокупателя КАК гф_СпецификацияПокупателя
	|		ПО ВТ_Спецификации.Ссылка = гф_СпецификацияПокупателя.Ссылка";   
	
	Запрос.Параметры.Вставить("Организация", Объект.Организация);
	Запрос.Параметры.Вставить("Склад", Объект.Склад);
	Запрос.Параметры.Вставить("Сезон", Объект.Сезон);
	Запрос.Параметры.Вставить("ВидНоменклатуры", Объект.ВидНоменклатуры);
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	СмещениеЗаказов = 2;
	СмещениеСпецификаций = 1;
	
	ИндексЗаказов = ПакетРезультатов.Количество() - СмещениеЗаказов;
	ИндексСпецификаций = ПакетРезультатов.Количество() - СмещениеСпецификаций;
	
	Объект.Заказы.Загрузить(ПакетРезультатов[ИндексЗаказов].Выгрузить());
	Объект.Спецификации.Загрузить(ПакетРезультатов[ИндексСпецификаций].Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	КомандаЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КомандаСоздатьСпецификацииНаСервере()
	
	Для Каждого СтрокаСпецификации Из Объект.Спецификации Цикл
		
		Если Не СтрокаСпецификации.Флаг Тогда
			
			Продолжить;
			
		КонецЕсли;	
		
		Если СтрокаСпецификации.Проведен Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По контрагенту " + 
				СтрокаСпецификации.Контрагент + " в табличной части присутствуют проведенные спецификации");
			
			Продолжить;
			
		КонецЕсли;	        

		Если ЗначениеЗаполнено(СтрокаСпецификации.СпецификацияПокупателя) Тогда
			
			СпецификацияОбъект = СтрокаСпецификации.СпецификацияПокупателя.ПолучитьОбъект();
			
			СпецификацияОбъект.ПометкаУдаления = Ложь;
			
			СпецификацияОбъект.ЗаказыКлиентов.Очистить();
			
		Иначе	
			
			СпецификацияОбъект = Документы.гф_СпецификацияПокупателя.СоздатьДокумент();
			
		КонецЕсли;
		
		ОтборЗаказов = Новый Структура("Контрагент, ДоговорКонтрагента",
										СтрокаСпецификации.Контрагент,
										СтрокаСпецификации.ДоговорКонтрагента);
										
		СтрокиЗаказов = Объект.Заказы.НайтиСтроки(ОтборЗаказов);										
		
		СпецификацияОбъект.Организация		= Объект.Организация;
		СпецификацияОбъект.Контрагент		= СтрокаСпецификации.Контрагент;
		СпецификацияОбъект.Договор			= СтрокаСпецификации.ДоговорКонтрагента;
		СпецификацияОбъект.Ответственный	= Пользователи.ТекущийПользователь();
		СпецификацияОбъект.Дата				= ТекущаяДатаСеанса();
		
		Для Каждого СтрокаЗаказа Из СтрокиЗаказов Цикл
			
			СтрокаДокумента = СпецификацияОбъект.ЗаказыКлиентов.Добавить();
			
			СтрокаДокумента.ЗаказКлиента = СтрокаЗаказа.ЗаказКлиента;
			
		КонецЦикла;	
		
		СпецификацияОбъект.Записать();
		
		СтрокаСпецификации.СпецификацияПокупателя = СпецификацияОбъект.Ссылка;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьСпецификации(Команда)
	КомандаСоздатьСпецификацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаПровестиНаСервере()

	Для Каждого СтрокаСпецификации Из Объект.Спецификации Цикл
		
		Если Не СтрокаСпецификации.Флаг Тогда
			
			Продолжить;
			
		КонецЕсли;	
		
		СпецификацияОбъект = СтрокаСпецификации.СпецификацияПокупателя.ПолучитьОбъект();
		
		Если Не СпецификацияОбъект.Проведен Тогда  
			
			СпецификацияОбъект.ПометкаУдаления = Ложь;
			
			СпецификацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			СтрокаСпецификации.Проведен = Истина;
			
		КонецЕсли;	
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПровести(Команда)

	КомандаПровестиНаСервере();

	ОповеститьОбИзменении(Тип("ДокументСсылка.гф_СпецификацияПокупателя"));
	
КонецПроцедуры

&НаСервере
Процедура КомандаОтменитьПроведениеНаСервере()
	
	Для Каждого СтрокаСпецификации Из Объект.Спецификации Цикл
		
		Если Не СтрокаСпецификации.Флаг Тогда
			
			Продолжить;
			
		КонецЕсли;	
		
		СпецификацияОбъект = СтрокаСпецификации.СпецификацияПокупателя.ПолучитьОбъект();
		
		Если СпецификацияОбъект.Проведен Тогда  
			
			СпецификацияОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
			СтрокаСпецификации.Проведен = Ложь;
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьПроведение(Команда)

	КомандаОтменитьПроведениеНаСервере();

	ОповеститьОбИзменении(Тип("ДокументСсылка.гф_СпецификацияПокупателя"));
	
КонецПроцедуры

&НаСервере
Процедура КомандаПометитьНаУдалениеНаСервере()

	Для Каждого СтрокаСпецификации Из Объект.Спецификации Цикл
		
		Если Не СтрокаСпецификации.Флаг Тогда
			
			Продолжить;
			
		КонецЕсли;	
		
		СпецификацияОбъект = СтрокаСпецификации.СпецификацияПокупателя.ПолучитьОбъект();
		
		Если Не СпецификацияОбъект.ПометкаУдаления Тогда  
			
			СпецификацияОбъект.УстановитьПометкуУдаления(Истина);
			
			СтрокаСпецификации.Проведен = Истина;
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПометитьНаУдаление(Команда)

	КомандаПометитьНаУдалениеНаСервере();
	
	ОповеститьОбИзменении(Тип("ДокументСсылка.гф_СпецификацияПокупателя"));
	
КонецПроцедуры

&НаСервере
Процедура КомандаСнятьПометкиНаУдалениеНаСервере()

	Для Каждого СтрокаСпецификации Из Объект.Спецификации Цикл
		
		Если Не СтрокаСпецификации.Флаг Тогда
			
			Продолжить;
			
		КонецЕсли;	
		
		СпецификацияОбъект = СтрокаСпецификации.СпецификацияПокупателя.ПолучитьОбъект();
		
		Если СпецификацияОбъект.ПометкаУдаления Тогда  
			
			СпецификацияОбъект.УстановитьПометкуУдаления(Ложь);
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьПометкиНаУдаление(Команда)

	КомандаСнятьПометкиНаУдалениеНаСервере();

	ОповеститьОбИзменении(Тип("ДокументСсылка.гф_СпецификацияПокупателя"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти
